Revit 2027 API
ITemporaryGraphicsHandler.OnClick Method
 Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnClick(
	TemporaryGraphicsCommandData data
)
Sub OnClick (
	data As TemporaryGraphicsCommandData
)
void OnClick(
	TemporaryGraphicsCommandData^ data
)
abstract OnClick :
        data : TemporaryGraphicsCommandData -> unit
Parameters
data TemporaryGraphicsCommandData
 The context data of the click event.
See Also
Reference
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace